{
	"hearYouThereDescription": "Hear You There is an app designed to generate playlists from music lineups. Manually adding tracks to your Spotify playlist can be a taxing process, especially when some music festivals can reach upwards of 100 artists. That is where Hear You There comes in. Simply copy the URL of an image, paste it into the input bar, and watch your playlist come to life.\n\nThe app uses Google's Cloud Vision REST API to parse the text from the inputted image. Once the image is parsed, queries are sent to the Spotify Web API to parse artists from the lines of text. Artists can be added or removed if the parsing process yields false positives or negatives, and once tracks are generated from the artist list, you can preview the tracks using Spotify HTML Widgets and remove them if they are not to your liking. With the playlist solidified, you can sign into Spotify and export the playlist!\n\nOther tools were used in addition to Google's Vision API and Spotify's Web API. The UI was developed using a combination of React and Bootstrap, and the back-end was built using Node.js and Express.js, among other Node modules.",
	"weDjDescription": "We DJ is an app designed to collaborate with others on a playlist. Frequently, when my friends and I are hanging out, one person controls the music. It can be frustrating trying to play music with which everyone will be happy, which is the problem We DJ solves. One person with Spotify Premium signs into the application with their Spotify account (on either the desktop version of Firefox or Chrome). A room is then created which other users may join. Users add songs to an onboarding list, which is then voted on by their peers. The highest voted song is then added to the queue. Additionally, the number of songs users submit that are voted onto the queue is tracked, and users are rewarded with a free song choice for every 2 songs voted into the queue. This allows users the chance to add songs that others may not have heard. When finished, the playlist can be exported for later listening.\n\nThis project was built using Bootstrap and JQuery on the front end, and C#/.NET Core on the backend. Furthermore, the Spotify Web API was used for searching for tracks and exporting playlists, and the Spotify Web Player was used for in browser music playing."
}